app/views/recipes/_recipe_ingredient_form.html.erb

<p>
  <%= f.collection_select :ingredient_id, Ingredient.order(:name), :id,:name, include_blank: true %>
---
SELECT "ingredients".* FROM "ingredients"  ORDER BY "ingredients"."name" ASC