app/views/recipes/show.html.erb

  <tr style="text-align: left;"><th>Name</th><th>Amount</th></tr>
  <% @cur_recipe.recipe_ingredients.each do |rec_ing| %>
---
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 3]]