app/views/homes/index.html.erb

              <% @users.each do |user| %>
                <li class="home-list"><%= link_to user.name, user_path(user) %><span class="badge glyphicon glyphicon-book"><span style="padding-left: 5px;"></span><%= user.recipes.count %></span></li>
---
SELECT "recipes".* FROM "recipes"