app/controllers/homes_controller.rb

  def index
    @recipes = Recipe.all
    @users = User.all
---
SELECT "recipes".* FROM "recipes"
SELECT "users".* FROM "users"