app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Taro"], ["created_at", "2015-04-07 20:59:11.224351"], ["updated_at", "2015-04-07 20:59:11.224351"]]
---
  def create
    @ingredient = Ingredient.new(ingredient_params)

    if @ingredient.save