app/controllers/logins_controller.rb

  def update
    user = User.find_by(name: params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "aff"]]