app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
    @recipes = Recipe.order('title ASC').all
    @recipes_left = []
    @recipes_right = []

    @recipes.each_with_index do |r, i|
      (i<=(@recipes.count/2)) ? @recipes_left.push(r) : @recipes_right.push(r)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 5]]
---
  def show
    @cur_recipe = Recipe.find_by(id: params[:id])

INSERT INTO "recipes" ("title", "instruction", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sagfsg"], ["instruction", "sgasdgs"], ["user_id", 1], ["created_at", "2015-05-18 19:01:16.753322"], ["updated_at", "2015-05-18 19:01:16.753322"]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = session[:user_id]

    respond_to do |format|
      if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 6]]
---
  def edit
    if session[:user_id]
      @ingredient = Ingredient.new
      @recipe = Recipe.find_by(id: params[:id])

UPDATE "recipes" SET "title" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["title", "fried calimari"], ["updated_at", "2015-04-06 19:13:21.789933"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @recipe.user_id == session[:user_id]
        @recipe_ingredient = @recipe.recipe_ingredients
        if @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 4]]
---
  def destroy
    if @recipe.user_id == session[:user_id]
      @recipe.destroy