app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 1
---
  def show
    @cur_user = User.find_by(id: params[:id])
    @recipes = Recipe.where(user: @cur_user)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "jerry"], ["password_digest", "$2a$10$VZgDQZeBAS29OVSh0THzn.aWCNwdNrwWscA8NahCPK43btgXwOu7y"], ["created_at", "2015-04-06 16:09:22.053937"], ["updated_at", "2015-04-06 16:09:22.053937"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save